Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_XBARA.h
/*! @name SEL81 - Crossbar A Select Register 81 */
/*! @{ */

#define XBARA_SEL81_SEL162_MASK                  (0xFFU)
#define XBARA_SEL81_SEL162_SHIFT                 (0U)
#define XBARA_SEL81_SEL162(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL81_SEL162_SHIFT)) & XBARA_SEL81_SEL162_MASK)

#define XBARA_SEL81_SEL163_MASK                  (0xFF00U)
#define XBARA_SEL81_SEL163_SHIFT                 (8U)
#define XBARA_SEL81_SEL163(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL81_SEL163_SHIFT)) & XBARA_SEL81_SEL163_MASK)
/*! @} */

/*! @name SEL82 - Crossbar A Select Register 82 */
/*! @{ */

#define XBARA_SEL82_SEL164_MASK                  (0xFFU)
#define XBARA_SEL82_SEL164_SHIFT                 (0U)
#define XBARA_SEL82_SEL164(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL82_SEL164_SHIFT)) & XBARA_SEL82_SEL164_MASK)

#define XBARA_SEL82_SEL165_MASK                  (0xFF00U)
#define XBARA_SEL82_SEL165_SHIFT                 (8U)
#define XBARA_SEL82_SEL165(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL82_SEL165_SHIFT)) & XBARA_SEL82_SEL165_MASK)
/*! @} */

/*! @name SEL83 - Crossbar A Select Register 83 */
/*! @{ */

#define XBARA_SEL83_SEL166_MASK                  (0xFFU)
#define XBARA_SEL83_SEL166_SHIFT                 (0U)
#define XBARA_SEL83_SEL166(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL83_SEL166_SHIFT)) & XBARA_SEL83_SEL166_MASK)

#define XBARA_SEL83_SEL167_MASK                  (0xFF00U)
#define XBARA_SEL83_SEL167_SHIFT                 (8U)
#define XBARA_SEL83_SEL167(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL83_SEL167_SHIFT)) & XBARA_SEL83_SEL167_MASK)
/*! @} */

/*! @name SEL84 - Crossbar A Select Register 84 */
/*! @{ */

#define XBARA_SEL84_SEL168_MASK                  (0xFFU)
#define XBARA_SEL84_SEL168_SHIFT                 (0U)
#define XBARA_SEL84_SEL168(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL84_SEL168_SHIFT)) & XBARA_SEL84_SEL168_MASK)

#define XBARA_SEL84_SEL169_MASK                  (0xFF00U)
#define XBARA_SEL84_SEL169_SHIFT                 (8U)
#define XBARA_SEL84_SEL169(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL84_SEL169_SHIFT)) & XBARA_SEL84_SEL169_MASK)
/*! @} */

/*! @name SEL85 - Crossbar A Select Register 85 */
/*! @{ */

#define XBARA_SEL85_SEL170_MASK                  (0xFFU)
#define XBARA_SEL85_SEL170_SHIFT                 (0U)
#define XBARA_SEL85_SEL170(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL85_SEL170_SHIFT)) & XBARA_SEL85_SEL170_MASK)

#define XBARA_SEL85_SEL171_MASK                  (0xFF00U)
#define XBARA_SEL85_SEL171_SHIFT                 (8U)
#define XBARA_SEL85_SEL171(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL85_SEL171_SHIFT)) & XBARA_SEL85_SEL171_MASK)
/*! @} */

/*! @name SEL86 - Crossbar A Select Register 86 */
/*! @{ */

#define XBARA_SEL86_SEL172_MASK                  (0xFFU)
#define XBARA_SEL86_SEL172_SHIFT                 (0U)
#define XBARA_SEL86_SEL172(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL86_SEL172_SHIFT)) & XBARA_SEL86_SEL172_MASK)

#define XBARA_SEL86_SEL173_MASK                  (0xFF00U)
#define XBARA_SEL86_SEL173_SHIFT                 (8U)
#define XBARA_SEL86_SEL173(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL86_SEL173_SHIFT)) & XBARA_SEL86_SEL173_MASK)
/*! @} */

/*! @name SEL87 - Crossbar A Select Register 87 */
/*! @{ */

#define XBARA_SEL87_SEL174_MASK                  (0xFFU)
#define XBARA_SEL87_SEL174_SHIFT                 (0U)
#define XBARA_SEL87_SEL174(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL87_SEL174_SHIFT)) & XBARA_SEL87_SEL174_MASK)

#define XBARA_SEL87_SEL175_MASK                  (0xFF00U)
#define XBARA_SEL87_SEL175_SHIFT                 (8U)
#define XBARA_SEL87_SEL175(x)                    (((uint16_t)(((uint16_t)(x)) << XBARA_SEL87_SEL175_SHIFT)) & XBARA_SEL87_SEL175_MASK)
/*! @} */

/*! @name CTRL0 - Crossbar A Control Register 0 */
/*! @{ */

#define XBARA_CTRL0_DEN0_MASK                    (0x1U)
#define XBARA_CTRL0_DEN0_SHIFT                   (0U)
/*! DEN0 - DMA Enable for XBAR_OUT0
 *  0b0..DMA disabled
 *  0b1..DMA enabled
 */
#define XBARA_CTRL0_DEN0(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_DEN0_SHIFT)) & XBARA_CTRL0_DEN0_MASK)

#define XBARA_CTRL0_IEN0_MASK                    (0x2U)
#define XBARA_CTRL0_IEN0_SHIFT                   (1U)
/*! IEN0 - Interrupt Enable for XBAR_OUT0
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define XBARA_CTRL0_IEN0(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_IEN0_SHIFT)) & XBARA_CTRL0_IEN0_MASK)

#define XBARA_CTRL0_EDGE0_MASK                   (0xCU)
#define XBARA_CTRL0_EDGE0_SHIFT                  (2U)
/*! EDGE0 - Active edge for edge detection on XBAR_OUT0
 *  0b00..STS0 never asserts
 *  0b01..STS0 asserts on rising edges of XBAR_OUT0
 *  0b10..STS0 asserts on falling edges of XBAR_OUT0
 *  0b11..STS0 asserts on rising and falling edges of XBAR_OUT0
 */
#define XBARA_CTRL0_EDGE0(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_EDGE0_SHIFT)) & XBARA_CTRL0_EDGE0_MASK)

#define XBARA_CTRL0_STS0_MASK                    (0x10U)
#define XBARA_CTRL0_STS0_SHIFT                   (4U)
/*! STS0 - Edge detection status for XBAR_OUT0
 *  0b0..Active edge not yet detected on XBAR_OUT0
 *  0b1..Active edge detected on XBAR_OUT0
 */
#define XBARA_CTRL0_STS0(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_STS0_SHIFT)) & XBARA_CTRL0_STS0_MASK)

#define XBARA_CTRL0_DEN1_MASK                    (0x100U)
#define XBARA_CTRL0_DEN1_SHIFT                   (8U)
/*! DEN1 - DMA Enable for XBAR_OUT1
 *  0b0..DMA disabled
 *  0b1..DMA enabled
 */
#define XBARA_CTRL0_DEN1(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_DEN1_SHIFT)) & XBARA_CTRL0_DEN1_MASK)

#define XBARA_CTRL0_IEN1_MASK                    (0x200U)
#define XBARA_CTRL0_IEN1_SHIFT                   (9U)
/*! IEN1 - Interrupt Enable for XBAR_OUT1
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define XBARA_CTRL0_IEN1(x)                      (((uint16_t)(((uint16_t)(x)) << XBARA_CTRL0_IEN1_SHIFT)) & XBARA_CTRL0_IEN1_MASK)

